app/controllers/students_controller.rb

    def update
        @student = Student.find(params[:id])
        @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Springer"], ["updated_at", "2020-10-13 01:24:44.568467"], ["id", 3]]